# -*- coding: utf-8 -*-

ruKeyMap = {
#    'a': 'a',
    'z': 'з',
    'd': 'д',
    'b': 'б',
    'v': 'в',
    'g': 'г',
    'i': 'и',
    'y': 'й',
    'k': 'к',
    'l': 'л',
    'm': 'м',
    'n': 'н',
#    'o': 'о',
    'p': 'п',
    'r': 'р',
    's': 'с',
    't': 'т',
    'u': 'у',
    'f': 'ф',
    'ò': 'ъ',
    'è': 'ы',
    'à': 'ь',
    'e': 'э',
    'ù': 'ю',
    'ì': 'я'
}

ruKeyMapSpecial = {
    'ye': 'e',
    'yo': 'ё',
    'zh': 'ж',
#    'kh': 'x',
    'ts': 'ц',
    'ch': 'ч',
    'sh': 'ш',
    'sc': 'щ'
}

